clc
clear all
%{
MEC 服务器的 CPU 工作频率 4GHz
任务的传输数据大小 在 300~1200KB 之间随机分布
任务所需的 CPU 工作周期数 0.1*10^9~1*10^9 之间随机分布
任务的最大完成时间 在 0.5~5s 之间随机分布
移动设备的本地 CPU 工作频率 0.2~1GHz
信道带宽 0.2MHz
 x 应该是随机产生的 x（1，：）是数据长度  x（2，：）是需要的工作周期数
                   x(3,:)是最大延迟  这里变成了多个小区
hi是信道参数，也应该是随机。
I是信道干扰，因为信道数少于移动设备数。
%}
%条件
x(:,:,1)=[787157.0 984575.0 702192.0 768663.0 657394.0
          461197222 357248933 491403999 397368822 786297177
   1.802526 2.704607 3.348886 3.30791 2.217739];
x(:,:,2)=[715315.0 872890.0 780967.0 591001.0 729557.0
   597629733 519093522 589905788 628979355 516016799
  2.039008 3.435385 3.056378 2.195885 2.287386
   ];
x(:,:,3)=[764296.0 804291.0 1057499.0 800046.0 782501.0
   576636122 430706177 631546533 561690777 598172211
   3.432247 3.727381 3.738657 3.433317 2.427195
   ];
x(:,:,4)=[735534.5  652180.2  800773.8  715923.5  921134.9
          508229664 430814447 608749645 600559994 561337651
          3.052794  2.430809  2.423213  2.735298  2.517545
          ];
x(:,:,5)=[892048.3  743773.8  790930.5  705540.3  869165.0
          453478757 598871791 466361361 527207144 481861654
          3.368810  2.838018  2.814051  2.229461  2.322614
          ];
    
        hi=[ 3.925414 , 6.147478 , 3.530716 , 2.833023 , 3.653565, 7.568968 , 5.010552 , 35.71505 , 4.165090 , 2.917472;
          ];
    
I=zeros(1,10);
hi;
n(:,1)=(wgn(1,1000000,0));
hy=[n n n n n n n n n n];
y=(hy);

%for loop=1:100
for l=1:5
for n=1:5
       m=1;
        for fi=0.2*10^9:0.001*10^8:1*10^9
            t(n,m,l)=x(2,n,l)/fi;
            if t(n,m,l)>x(3,n,l)
                t(n,m,l)=100;
            end
            m=m+1;
            
        end
    
end
for n=1:5
       m=1;
        for fi=0.2*10^9:0.001*10^8:1*10^9
            e(n,m,l)=x(2,n,l)*fi^2*10^(-26);
            m=m+1;
        end
    
end
GL=0.2*t+0.8*e;
for n=1:5
gl(l,n)=min(GL(n,:,l));
end
for n=1:5
for v=1:1000%期望
    for s=1:10
       m=1;
        for pi=0.001:0.0005:10^-0.7
            ri=0.2*10^6*log2(1+(pi*(hi(s)+y(v,n))^2)/(I(s)+1));
            tc(n,m,s,l)=x(1,n,l)/ri+x(2,n,l)/(4*10^9);
           if tc(n,m,s,l)>x(3,n,l)
                tc(n,m,s,l)=100;
           end
            m=m+1;
            
        end
    end

    for s=1:10
       m=1;
        for pi=0.001:0.0005:10^-0.7
            ri=0.2*10^6*log2(1+(pi*(hi(s)+y(v,n))^2)/(I(s)+1));
            ec(n,m,s,l)=pi*x(1,n,l)/ri;
            m=m+1;
        end
    end

GC=0.2*tc+0.8*ec;

    aa(l,v,n)=1000000;
    for s=1:10
gc(l,v,n)=min(GC(n,:,s,l));
if gc(l,v,n)<aa(l,v,n)
    aa(l,v,n)=gc(l,v,n);
    num=s;
[min_val, position_min] = min(GC(n,:,s,l)); 
[p,q] = ind2sub(size(GC(n,:,s,l)),position_min);
end
    end
end
   
gcc(l,n)=mean(aa(l,:,n));


g=[gl(l,n);gcc(l,n)];
G(n)=min(g);
if g(1,1)<g(2,1)
    sa(l,n)=0;
else
    sa(l,n)=1;
    I(num)=(pi+q*0.0005)*hi(num)^2+I(num);%干扰更新
end
end
C(l)=sum(G);
end
cc=sum(C)